Repository: ministryofjustice/fala
Catalog: fala/locale/*/LC_MESSAGES/django.po
Languages: cy

source: monitor use of the site to identify security threats
cy: monitro sut caiff y wefan ei defnyddio i ganfod bygythiadau i ddiogelwch

source: We use the information we collect through Google Analytics to see how you use the service and to see how well it performs on your device.
cy: Rydym yn defnyddio’r wybodaeth rydym yn ei chasglu drwy Google Analytics i weld sut rydych chi’n defnyddio’r gwasanaeth ac i weld pa mor dda mae’n perfformio ar eich dyfais.

source: We do this to help:
cy: Rydym yn gwneud hyn i helpu i wneud y canlynol:

source: make sure the service is meeting the needs of its users
cy: sicrhau bod y gwasanaeth yn diwallu anghenion ei ddefnyddwyr

source: make improvements to the service
cy: gwella’r gwasanaeth

source: make performance improvements, for example improving page load time and data usage
cy: gwella perfformiad, er enghraifft, gwella amser llwytho tudalennau a’r data a ddefnyddir

source: Our legal basis for processing your data
cy: Ein sail gyfreithiol dros ddefnyddio eich data

source: The legal basis for processing personal data in relation to site security is our legitimate interests, and the legitimate interests of our users, in ensuring the security and integrity of this service.
cy: Y sail gyfreithiol dros brosesu data personol mewn perthynas â diogelwch y wefan yw ein buddiannau dilys, a buddiannau dilys ein defnyddwyr, i sicrhau diogelwch ac uniondeb y gwasanaeth hwn.

source: The legal basis for processing all other data is that it’s necessary to provide a service and our legitimate interest in understanding the usage of our service.
cy: Y sail gyfreithiol dros brosesu’r holl ddata arall yw ei fod yn angenrheidiol i ddarparu gwasanaeth a’n buddiant dilys yw deall sut caiff ein gwasanaeth ei ddefnyddio.

source: The legal basis for processing data collected with Google Analytics in this service is your consent.
cy: Eich caniatâd chi yw’r sail gyfreithiol dros brosesu data a gesglir gyda Google Analytics yn y gwasanaeth hwn.

source: What we do with your data
cy: Beth rydym yn ei wneud â’ch data

source: The data we collect with Google Analytics cookies is transferred and stored with Google where we analyse it with Google Analytics software (Google Analytics 4).
cy: Mae’r data rydym yn ei gasglu gyda chwcis Google Analytics yn cael ei drosglwyddo a’i storio gyda Google lle rydym yn ei ddadansoddi gyda meddalwedd Google Analytics (Google Analytics 4).

source: We do not allow Google to use or share this data for their own purposes.
cy: Nid ydym yn caniatáu i Google ddefnyddio na rhannu’r data hwn at ei ddibenion ei hun.

source: No information that you provide will be shared outside the MoJ, other than with MoJ IT providers that provide services supporting the running of this service.
cy: Ni fydd unrhyw wybodaeth a roddwch yn cael ei rhannu y tu allan i’r Weinyddiaeth Gyfiawnder, heblaw gyda darparwyr TG y Weinyddiaeth Gyfiawnder sy’n darparu gwasanaethau sy’n helpu i redeg y gwasanaeth hwn.

source: We will not:
cy: Ni fyddwn yn gwneud y canlynol:

source: sell or rent data to third parties
cy: gwerthu na rhentu eich data i drydydd partïon

source: share data with third parties for marketing purposes
cy: rhannu data â thrydydd partïon at ddibenion marchnata

source: How long we keep your data
cy: Am ba mor hir y byddwn yn cadw eich data

source: We will only retain your data for as long as it is needed for the purposes set out on this page.
cy: Byddwn ond yn cadw eich data cyhyd ag y bydd ei angen at y dibenion a nodir ar y dudalen hon.

source: We will retain summary logs of interactions with the service, but these logs are fully anonymous.
cy: Byddwn yn cadw cofnodion cryno o gysylltiadau â’r gwasanaeth, ond mae’r cofnodion hyn yn gwbl ddienw.

source: Where your data is processed and stored
cy: Ble caiff eich data ei brosesu a’i storio

source: We design, build and run our systems to make sure that your data is as safe as possible at all stages, both while it’s processed and when it’s stored.
cy: Rydym yn dylunio, yn creu ac yn rhedeg ein systemau i wneud yn siŵr bod eich data mor ddiogel â phosibl ym mhob cam, pan gaiff ei brosesu a phan gaiff ei storio.

source: All personal data is processed in the
cy: Caiff yr holl ddata personol ei brosesu yn yr

source: How we protect your data and keep it secure
cy: Sut rydym yn diogelu eich data ac yn ei gadw’n ddiogel

source: We are committed to doing all that we can to keep your data secure.
cy: Rydym wedi ymrwymo i wneud popeth o fewn ein gallu i gadw eich data’n ddiogel.

source: We have set up systems and processes to prevent unauthorised access or disclosure of your data.
cy: Rydym wedi creu systemau a phrosesau i sicrhau nad oes neb sydd heb ei awdurdodi yn gweld nac yn datgelu eich data.

source: Links to other websites
cy: Dolenni i wefannau eraill

source: This service contains links to other websites.
cy: Mae’r gwasanaeth hwn yn cynnwys dolenni i wefannau eraill.

source: This privacy notice only applies to this service and does not cover other government services and transactions that we link to.
cy: Dim ond i’r gwasanaeth hwn y mae’r hysbysiad preifatrwydd hwn yn berthnasol ac nid yw’n berthnasol i wasanaethau a thrafodion eraill y llywodraeth yr ydym darparu dolenni atynt.

source: If you follow a link to a service provided by another government department or agency, that organisation will:
cy: Os byddwch yn dilyn dolen i wasanaeth a ddarperir gan un o adrannau neu asiantaethau eraill y llywodraeth, y sefydliad hwnnw:

source: be the data controller
cy: fydd yn rheolydd data

source: be responsible for processing any data you share with them
cy: fydd yn gyfrifol am brosesu unrhyw ddata rydych chi’n ei rannu gyda nhw

source: publish and manage their own privacy notice with details of how to contact them
cy: a bydd yn cyhoeddi ac yn rheoli ei hysbysiad preifatrwydd ei hun gyda manylion am sut i gysylltu â nhw

source: Contact us or make a complaint
cy: Cysylltu â ni neu wneud cwyn

source: Contact us by email at
cy: Cysylltwch â ni drwy anfon e-bost at

source: have a question about anything in this privacy notice
cy: oes gennych chi gwestiwn am unrhyw beth yn yr hysbysiad preifatrwydd hwn

source: think that your personal data has been misused or mishandled
cy: os ydych chi’n meddwl bod eich data personol wedi cael ei drin neu ei ddefnyddio’n amhriodol

source: You can also contact our Data Protection Officer
cy: Gallwch hefyd gysylltu â’n Swyddog Diogelu Data

source: The DPO leads on all aspects of data protection for the MoJ.
cy: Y DPO sy’n arwain ar bob agwedd ar ddiogelu data ar gyfer y Weinyddiaeth Gyfiawnder.

source: When we ask you for information, we will comply with the law.
cy: Pan fyddwn yn gofyn i chi am wybodaeth, byddwn yn cydymffurfio â’r gyfraith.

source: If you consider that your information has been handled incorrectly, you can contact the Information Commissioner for independent advice about data protection.
cy: Os ydych chi’n credu bod eich gwybodaeth bersonol wedi cael ei thrin yn anghywir, gallwch gysylltu â’r Comisiynydd Gwybodaeth i gael cyngor annibynnol ar ddiogelu data.

source: You can contact the Information Commissioner at:
cy: Gallwch gysylltu â’r Comisiynydd Gwybodaeth gyda’r manylion hyn:

source: Information Commissioner
cy: Y Comisiynydd Gwybodaeth

source: Telephone: 0303 123 1113
cy: Ffôn: 0303 123 1113

source: Textphone: 01625 545860
cy: Ffôn testun: 01625 545860

source: Monday to Friday, 9am to 4:30pm
cy: Dydd Llun i ddydd Gwener 9am tan 4:30pm

source: Find out about call charges
cy: Costau galwadau

source: Changes to this policy
cy: Newidiadau i’r polisi hwn

source: We may change this privacy policy. In that case, the ‘last updated’ date at the bottom of this page will also change. Any changes to this privacy policy will apply to you and your data immediately.
cy: Efallai y byddwn yn newid y polisi preifatrwydd hwn. Os felly, bydd y dyddiad ‘diweddarwyd ddiwethaf’ ar waelod y dudalen hon hefyd yn newid. Bydd unrhyw newidiadau i’r hysbysiad preifatrwydd hwn yn weithredol i chi a’ch data ar unwaith.

source: Last updated 25 June 2024
cy: Diweddarwyd ddiwethaf 25 June 2024

source: No search results
cy: Dim canlyniadau chwilio

source: There are no results for your criteria.
cy: Nid oes dim canlyniadau ar gyfer eich meini prawf.

source: You can contact any legal adviser on the list but you might need to contact a few to find one near you that can help. Those based further away may be able to help by telephone.
cy: Gallwch gysylltu ag unrhyw gynghorydd cyfreithiol ar y rhestr ond efallai y bydd angen i chi gysylltu ag un neu ddau cyn dod o hyd i un yn eich ardal chi a all helpu. Efallai y bydd y rheini sydd wedi’u lleoli ymhellach i ffwrdd yn gallu helpu dros y ffôn.

source: These advisers are contracted by the government and regulated by the Solicitors Regulation Authority.
cy: Caiff y cynghorwyr hyn eu contractio gan y llywodraeth a’u rheoleiddio gan yr Awdurdod Rheoleiddio Cyfreithwyr.

source: What you searched for
cy: Beth wnaethoch chi chwilio amdano

source: Postcode:
cy: Cod post:

source: Organisation:
cy: Sefydliad:

source: Legal problem:
cy: Problem gyfreithiol:

source: Search for something else
cy: Chwilio am rywbeth arall

source: Print this page
cy: Argraffu’r dudalen hon

source: matching
cy: sy’n cyfateb i

source: Distance
cy: Pellter

source: %(miles)s miles away
cy: %(miles)s milltir i ffwrdd

source: Address
cy: Cyfeiriad

source: View on map (opens in new tab)
cy: Gweld ar fap (mae’n agor mewn tab newydd)

source: Can help with
cy: Yn gallu helpu gyda

source: Find a Legal Aid Adviser or Family Mediator
cy: Dod o hyd i gynghorydd cymorth cyfreithiol neu gyfryngwr teulu

source: Use this service to find legal aid advisers in England and Wales. They will ask about your problem and finances to work out if you can get legal aid.
cy: Defnyddiwch y gwasanaeth hwn i ddod o hyd i gynghorwyr cyfreithiol yng Nghymru a Lloegr yn eich ardal chi. Byddant yn gofyn am eich problem a’ch sefyllfa ariannol i weld a allwch chi gael cymorth cyfreithiol.

source: You can
cy: Gallwch

source: check if your problem is covered by legal aid (opens in a new tab)
cy: wirio a yw’ch problem yn gymwys i gael cymorth cyfreithiol (yn agor mewn tab newydd)

source: before your call.
cy: cyn eich galwad.

source: Name of organisation you are looking for (optional)
cy: Enw’r sefydliad rydych chi’n chwilio amdano (dewisol)

source: For example, Citizens Advice or Shelter
cy: Er enghraifft, Cyngor ar Bopeth neu Shelter

source: Legal problem (optional)
cy: Problem gyfreithiol (dewisol)

source: If you are a provider and your details are incorrect, contact your contract manager.
cy: Os ydych chi’n ddarparwr ac mae eich manylion yn anghywir, cysylltwch rheolwr eich contract.

source: GOV.UK - The best place to find government services and information
cy: GOV.UK - Y lle gorau i ddod o hyd i wybodaeth a gwasanaethau’r llywodraeth

source: Skip to main content
cy: Ymlaen i’r prif gynnwys

source: Sorry, the service is unavailable
cy: Yn anffodus, nid yw’r gwasanaeth ar gael

source: You will be able to use the service soon.
cy: Byddwch yn gallu defnyddio’r gwasanaeth hwn yn fuan.

source: You might be able to get help from
cy: Efallai y gallwch gael cymorth gan

source: Civil Legal Advice
cy: Cyngor Cyfreithiol Sifi

source: if you’re in England or Wales.
cy: os ydych yn byw yng Nghymru neu Loegr.
