Repository: ministryofjustice/fala
Catalog: fala/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Enter a postcode
cy: Rhowch god post

source: Enter an organisation name
cy: Rhowch enw eich sefydliad

source: Enter a valid postcode
cy: Rhowch god post dilys

source: Postcode
cy: Cod post

source: Organisation name
cy: Enw'r sefydliad

source: Category
cy: Categori

source: Error looking up legal advisers.
cy: Profwyd gwall wrth geisio dod o hyd i gynghorwyr cyfreithiol

source: Please try again later.
cy: Rhowch gynnig arall arni yn hwyrach ymlaen.

source: This service is only available for England and Wales
cy: Mae’r gwasanaeth hwn ar gyfer pobl sy’n byw yng Nghymru a Lloegr yn unig

source: Claims Against Public Authorities
cy: Hawliadau yn erbyn Awdurdodau Cyhoeddus

source: Clinical negligence
cy: Esgeulustod clinigol

source: Community care
cy: Gofal yn y gymuned

source: Crime
cy: Trosedd

source: Debt
cy: Dyledion

source: Discrimination
cy: Gwahaniaethu

source: Education
cy: Addysg

source: Family
cy: Teulu

source: Family mediation
cy: Cyfryngu i Deuluoedd

source: Housing
cy: Tai

source: Housing Loss Prevention Advice Service
cy: Gwasanaeth Cynghori Rhag Colli Tŷ

source: Immigration or asylum
cy: Mewnfudo neu loches

source: Mental health
cy: Iechyd meddwl

source: Modern slavery
cy: Caethwasiaeth fodern

source: Prison law
cy: Cyfraith garchardai

source: Public law
cy: Cyfraith gyhoeddus

source: Welfare benefits
cy: Budd-daliadau lles

source: Tell the adviser your home is at risk and you want advice through the Housing Loss Prevention Advice Service.
cy: Dywedwch wrth y cynghorydd bod eich cartref mewn perygl a’ch bod am gael cyngor drwy’r Gwasanaeth Cynghori Rhag Colli Tŷ.

source: Previous
cy: Cynt

source: Next
cy: Nesaf

source: Northern Ireland
cy: Gogledd Iwerddon

source: the Isle of Man
cy: Ynys Manaw

source: Guernsey
cy: Gurnsey

source: Error looking up legal advisers. Please try again later.
cy: Profwyd gwall wrth geisio dod o hyd i gynghorwyr cyfreithiol. Rhowch gynnig arall arni yn hwyrach ymlaen.

source: English
cy: Saesneg

source: Page not found - 404 -
cy: Heb ddod o hyd i’r dudalen - 404-

source: Page not found
cy: Heb ddod o hyd i’r dudalen

source: If you entered a web address please check it was correct.
cy: Os bu ichi deipio cyfeiriad gwefan, gwiriwch ei fod yn gywir.

source: Alternatively return to
cy: Fel arall, dychwelwch i

source: homepage
cy: hafan

source: and try again.
cy: a rhowch gynnig arall arni.

source: Sorry, there is a problem with the service - Find a legal advisor or family mediator - GOV.UK
cy: Mae’n ddrwg gennym, ond mae problem gyda’r gwasanaeth - Dod o hyd i gynghorydd cymorth cyfreithiol neu gyfryngwr teulu - GOV.UK

source: Sorry, there is a problem with the service
cy: Mae’n ddrwg gennym, ond mae problem gyda’r gwasanaeth

source: Try again later.
cy: Rhowch gynnig arall arni hwyrach ymlaen.

source: You can also
cy: Gallwch hefyd

source: find a solicitor
cy: ddod o hyd i gyfreithiwr

source: on the Law Society website.
cy: ar wefan Cymdeithas y Gyfraith.

source: Search using your location, then select ‘Accepts legal aid’ to show legal aid solicitors near you.
cy: Chwilio gan ddefnyddio eich lleoliad, yna dewiswch ‘Derbyn cymorth cyfreithiol’ i ddangos cyfreithwyr cymorth cyfreithiol yn agos atoch chi.

source: the pages you visit
cy: y tudalennau rydych chi’n ymweld â nhw

source: the categories you use to search
cy: y categorïau rydych chi’n eu defnyddio i chwilio

source: the postcode you use to search
cy: y cod post rydych chi’n ei ddefnyddio i chwilio

source: how long you spend on each page
cy: faint o amser rydych chi’n ei dreulio ar bob tudalen

source: how you arrived at the service
cy: sut gwnaethoch gyrraedd y gwasanaeth

source: what you click on while you visit the service
cy: beth rydych yn clicio arno wrth ddefnyddio’r gwasanaeth

source: the device and browser you use
cy: y ddyfais a’r porwr rydych chi’n eu defnyddio

source: We use some essential cookies to make this service work.
cy: Rydym yn defnyddio rhai cwcis hanfodol i wneud i’r gwasanaeth hwn weithio.

source: We’d like to set additional cookies so we can remember your settings, understand how people use the service and make improvements.
cy: Hoffem hefyd ddefnyddio cwcis ychwanegol er mwyn i ni allu cofio eich gosodiadau, deall sut mae pobl yn defnyddio’r gwasanaeth a gwneud gwelliannau.

source: You’ve accepted additional cookies. You can
cy: Rydych wedi derbyn cwcis ychwanegol. Gallwch

source: change your cookie settings
cy: newid eich gosodiadau cwcis ar

source: at any time.
cy: unrhyw adeg.

source: You’ve rejected additional cookies. You can
cy: Rydych wedi gwrthod cwcis ychwanegol. Gallwch

source: Cookies on Find a legal adviser or family mediator
cy: Cwcis ar Dod o hyd i gynghorydd cyfreithiol neu gyfryngwr teulu

source: Accept analytics cookies
cy: Derbyn cwcis dadansoddol

source: Reject analytics cookies
cy: Gwrthod cwcis dadansoddol

source: View cookies
cy: Gweld y cwcis

source: Hide this message
cy: Cuddio’r neges hon

source: Support links
cy: Dolenni Cefnogi

source: Privacy
cy: Preifatrwydd

source: Cookies
cy: Cwcis

source: Legal Aid Agency
cy: Yr Asiantaeth Cymorth Cyfreithiol

source: Accessibility statement
cy: Datganiad Hygyrchedd

source: Built by
cy: Crëwyd gan

source: Digital Services
cy: Wasanaethau Digidol

source: All content is available under the
cy: Mae’r holl gynnwys ar gael o dan

source: Open Government Licence v3.0
cy: Drwydded Llywodraeth Agored f3.0

source: , except where otherwise stated
cy: , ac eithrio lle nodir fel arall

source: © Crown copyright
cy: © Hawlfraint y goron

source: Help improve this legal adviser search
cy: Helpwch i wella’r chwiliad hwn am gynghorwyr cyfreithiol

source: Take part (opens in new tab)
cy: Cymryd rhan (yn agor mewn tab newydd)

source: Your nearest legal aid advisers and family mediators
cy: Eich cynghorwyr cymorth cyfreithiol a chyfryngwyr teulu agosaf

source: Your nearest legal aid advisers for the
cy: Eich cynghorwyr cymorth cyfreithiol agosaf ar gyfer y

source: Your nearest legal aid advisers for
cy: Eich cynghorwyr cymorth cyfreithiol agosaf ar gyfer

source: Search results
cy: Canlyniad chwilio

source: Your nearest legal aid advisers
cy: Eich cynghorwyr cymorth cyfreithiol agosaf

source: These results cover England and Wales. Find out about <a class="govuk-link" href="https://www.mygov.scot/legal-aid/">Legal Aid in Scotland.</a>
cy: Mae'r canlyniadau hyn yn berthnasol i Gymru a Lloegr. Cael gwybod am <a class="govuk-link" href="https://www.mygov.scot/legal-aid/">Gymorth Cyfreithiol yn yr Alban.</a>

source: Accessibility statement for Find a legal advisor
cy: Datganiad hygyrchedd ar gyfer Dod o hyd i gynghorydd cyfreithiol

source: This accessibility statement applies to the ‘Find a legal advisor’ service.
cy: Mae’r datganiad hygyrchedd hwn yn berthnasol i’r gwasanaeth ‘Dod o hyd i gynghorydd cyfreithiol’.

source: This website is run by the <a class='govuk-link' href='https://www.gov.uk/government/organisations/legal-aid-agency' rel='external'>Legal Aid Agency</a> (<abbr>LAA</abbr>), part of the Ministry of Justice (<abbr>MoJ</abbr>). We want as many people as possible to be able to use this website. For example, that means you should be able to:
cy: Yr <a class='govuk-link' href='https://www.gov.uk/government/organisations/legal-aid-agency' rel='external'>Asiantaeth Cymorth Cyfreithiol</a> (<abbr>LAA</abbr>), sy’n rhan o’r Weinyddiaeth Gyfiawnder (<abbr>MoJ</abbr>), sy’n rhedeg y wefan hon. Rydyn ni eisiau i gynifer o bobl ag sy’n bosibl allu defnyddio’r wefan hon. Er enghraifft, mae hynny’n golygu y dylech allu:

source: change colours, contrast levels and fonts using browser or device settings
cy: newid lliwiau, lefelau cyferbynnedd a ffontiau gan ddefnyddio gosodiadau’r porwr neu’r ddyfais

source: zoom in up to 400%% without the text spilling off the screen
cy: chwyddo mewn hyd at 400%% heb i’r testun lifo oddi ar y sgrin

source: navigate most of the website using a keyboard or speech recognition software
cy: llywio drwy’r rhan fwyaf o’r wefan gan ddefnyddio bysellfwrdd neu feddalwedd adnabod llais

source: listen to most of the website using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: gwrando ar y rhan fwyaf o’r wefan gan ddefnyddio darllenydd sgrin (gan gynnwys y fersiynau diweddaraf o JAWS, NVDA a VoiceOver)

source: We’ve also made the website text as simple as possible to understand.
cy: Rydyn ni hefyd wedi gwneud testun y wefan mor hawdd i’w ddeall ag sy’n bosibl.

source: <a class='govuk-link' href='https://mcmw.abilitynet.org.uk/' rel='external'>AbilityNet</a> has advice on making your device easier to use if you have a disability.
cy: Mae gan <a class='govuk-link' href='https://mcmw.abilitynet.org.uk/' rel='external'>AbilityNet</a> gyngor ar wneud eich dyfais yn haws ei defnyddio os oes gennych chi anabledd.

source: How accessible this website is
cy: Pa mor hygyrch yw’r wefan hon

source: We know some parts of this website are not fully accessible:
cy: Rydyn ni’n ymwybodol nad yw rhannau o’r wefan hon yn gwbl hygyrch:

source: elements of the results page do not meet minimum contrast standards
cy: mae elfennau o’r dudalen canlyniadau nad ydynt yn bodloni’r safonau cyferbynnedd gofynnol

source: Google Translate does not translate technical terms into Plain English
cy: Nid yw Google Translate yn cyfieithu termau technegol i Saesneg clir

source: hyperlinks to google maps are not specific about the listing they are related to
cy: nid yw hyperddolenni at fapiau google yn benodol i’r eitem y maent yn gysylltiedig â hi

source: Feedback and contact information
cy: Adborth a gwybodaeth gyswllt

source: We’re always looking to improve the accessibility of this website. If you find any problems not listed on this page or think we’re not meeting accessibility requirements, contact us by email at
cy: Rydyn ni bob amser yn awyddus i wella hygyrchedd y wefan hon. Os ydych chi’n dod ar draws unrhyw broblemau sydd heb eu rhestru ar y dudalen hon neu os ydych chi’n credu nad ydym yn bodloni gofynion hygyrchedd, anfonwch e-bost i:

source: Enforcement procedure
cy: Gweithdrefn orfodi

source: The Equality and Human Rights Commission (<abbr>EHRC</abbr>) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (the ‘accessibility regulations’). If you’re not happy with how we respond to your complaint, <a class="govuk-link" href="https://www.equalityadvisoryservice.com/" rel="external">contact the Equality Advisory and Support Service (<abbr>EASS</abbr>)</a>.
cy: Y Comisiwn Cydraddoldeb a Hawliau Dynol (<abbr>EHRC</abbr>) sy’n gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018 (y ‘rheoliadau hygyrchedd’). Os nad ydych chi’n fodlon â sut rydyn ni’n ymateb i’ch cwyn, <a class="govuk-link" href="https://www.equalityadvisoryservice.com/" rel="external">cysylltwch â’r Gwasanaeth Cynghori a Chefnogi Cydraddoldeb (<abbr>EASS</abbr>)</a>.

source: Technical information about this website’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan hon

source: The Legal Aid Agency is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.
cy: Mae’r Asiantaeth Cymorth Cyfreithiol wedi ymrwymo i wneud ei gwefan yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018.

source: Compliance status
cy: Statws cydymffurfio

source: This website is <strong>partially compliant</strong> with the Web Content Accessibility Guidelines (<abbr>WCAG</abbr>) version 2.2 AA standard, due to the existing issues listed below.
cy: Mae’r gwefan hon yn <strong>cydymffurfio’n rhannol</strong> â safon AA Canllawiau Hygyrchedd Cynnwys y We (<abbr>WCAG</abbr>) fersiwn 2.2, oherwydd y materion sy’n bodoli eisoes a restrir isod.

source: Non-accessible content
cy: Cynnwys nad yw’n hygyrch

source: The content listed below is non-accessible for the following reasons.
cy: Nid yw’r cynnwys a restrir isod yn hygyrch am y rhesymau canlynol.

source: The results page border does not have sufficient colour contrast. This fails WCAG success criterion 1.4.3 Contrast (Minimum). We plan to fix this by the end of July 2024.
cy: Nid oes gan forder y dudalen ganlyniadau gyferbynnedd lliw digonol. Mae hyn yn methu maen prawf llwyddiant WCAG 1.4.3 Cyferbynnedd (Gofynnol). Rydym yn gobeithio cywiro hyn erbyn diwedd mis Gorffennaf 2024.

source: The links to google maps elements are not identifiable from the link text alone. This fails WCAG success criterion 2.4.9 Link Purpose. We plan to fix this by the end of October 2024.
cy: Nid oes modd adnabod y dolenni i elfennau google maps oddi wrth destun y ddolen yn unig. Mae hyn yn methu maen prawf llwyddiant WCAG 2.4.9 Diben Dolenni. Rydym yn gobeithio cywiro hyn erbyn diwedd mis Hydref 2024.

source: The results page title is the same as the main page and so does not clearly describe the topic or purpose. This fails WCAG success criterion 2.4.2 Page Titled. We plan to fix this by the end of October 2024.
cy: Mae teitl y dudalen ganlyniadau yr un fath â’r brif dudalen ac felly nid yw’n disgrifio’r pwnc na’r diben yn glir. Mae hyn yn methu maen prawf llwyddiant WCAG 2.4.2 Teitlau Tudalennau. Rydym yn gobeithio cywiro hyn erbyn diwedd mis Hydref 2024.

source: Disproportionate burden
cy: Baich anghymesur

source: Not applicable
cy: Ddim yn berthnasol

source: Content that’s not within the scope of the accessibility regulations
cy: Cynnwys nad yw o fewn cwmpas y rheoliadau hygyrchedd

source: Preparation of this accessibility statement
cy: Paratoi’r datganiad hygyrchedd hwn

source: This statement was prepared on 11 November 2020. It was last reviewed on 13 June 2024.
cy: Cafodd y datganiad hwn ei baratoi ar 11 Tachwedd 2020. Cafodd ei adolygu ddiwethaf ar 13 Mehefin 2024.

source: This website was last tested on 12 June 2024. The test was carried out by the Ministry of Justice. We tested all of the pages using a basic accessibility test, but this was not a full audit.
cy: Cafodd y wefan hon ei phrofi ddiwethaf ar 12 Mehefin 2024. Cynhaliwyd y prawf gan y Weinyddiaeth Gyfiawnder. Fe wnaethom brofi’r holl dudalennau gan ddefnyddio prawf hygyrchedd sylfaenol, ond nid oedd hwn yn archwiliad llawn.

source: This statement will be reviewed by June 2025. We plan to audit the website against the WCAG 2.2 AA standard by June 2025.
cy: Bydd y datganiad hwn yn cael ei adolygu erbyn Mehefin 2025. Rydym yn bwriadu archwilio’r wefan yn erbyn safon AA WCAG 2.2 erbyn mis Mehefin 2025.

source: Find a legal aid adviser or family mediator
cy: Dod o hyd i gynghorydd cymorth cyfreithiol neu gyfryngwr teulu

source: This is a new service – your
cy: Mae hwn yn wasanaeth newydd – bydd eich

source: feedback (opens in new tab)
cy: adborth (mae’n agor mewn tab newydd)

source: will help us to improve it.
cy: yn ein helpu i’w wella

source: Find a legal aid adviser
cy: Dod o hyd i gynghorydd cymorth cyfreithiol

source: or family mediator
cy: neu gyfryngwr teulu

source: Search for a legal adviser or family mediator with a legal aid contract in England and Wales.
cy: Chwilio am gynghorydd cyfreithiol neu gyfryngwr teuluol gyda chontract cymorth cyfreithiol yng Nghymru a Lloegr.

source: If you are a provider and your details are incorrect, please contact your contract manager.
cy: Os ydych chi’n ddarparwr ac mae eich manylion yn anghywir, cysylltwch rheolwr eich contract.

source: Error:
cy: Gwall:

source: Find a legal aid adviser for
cy: Dod o hyd i gynghorydd cymorth cyfreithiol ar gyfer

source: the
cy: y

source: There is a problem
cy: Mae problem

source: Exit this page
cy: Gadael y dudalen hon

source: Search for official legal aid advisers in England and Wales.
cy: Chwilio am gynghorwyr cymorth cyfreithiol swyddogol yng Nghymru a Lloegr.

source: Next steps
cy: Y camau nesaf

source: We'll show you a list of legal advisers.
cy: Byddwn yn dangos rhestr o gynghorwyr cyfreithiol i chi.

source: When you contact the adviser they'll ask about your problem and finances to work out if you can get legal aid.
cy: Pan fyddwch chi'n cysylltu â'r cynghorydd, bydd yn gofyn am eich problem a’ch sefyllfa ariannol i weld a allwch chi gael cymorth cyfreithiol.

source: For example, NE31 1SF, or a partial postcode like NE31, S1 or SW1X.
cy: Er enghraifft, NE31 1SF, neu rhan o god post fel NE31, S1 neu SW1X.

source: Search
cy: Chwilio

source: Success
cy: Llwyddiant

source: Your cookie settings were saved
cy: Cafodd eich gosodiadau cwcis eu cadw

source: Other government services may set additional cookies. These will have a separate cookie policy and banner.
cy: Efallai y bydd gwasanaethau eraill y llywodraeth yn gosod cwcis ychwanegol. Bydd gan y rhainfaner a pholisi cwcis ar wahân.

source: Go back to the page you were looking at
cy: Mynd yn ôl i’r dudalen roeddech chi’n edrych arni

source: Do you want to accept analytics cookies?
cy: Ydych chi eisiau derbyn cwcis dadansoddol?

source: Yes
cy: Ydw

source: No
cy: Nac ydw

source: Save cookie settings
cy: Cadw’r gosodiadau cwcis

source: puts small files (known as ‘cookies’) on your computer.
cy: yn rhoi ffeiliau bach (a elwir yn ‘gwcis’) ar eich cyfrifiadur.

source: These cookies are used across the Find a legal aid adviser or family mediator website.
cy: Defnyddir y cwcis hyn ar draws gwefan Dod o hyd i gynghorydd cymorth cyfreithiol neu gyfryngwr teulu.

source: Find out
cy: Mae rhagor o wybodaeth am

source: how to manage cookies
cy: sut i reoli cwcis

source: from the Information Commissioner's Office.
cy: ar gael gan Swyddfa’r Comisiynydd Gwybodaeth.

source: Cookie settings
cy: Gosodiadau cwcis

source: We use Javascript to set most of our cookies. Unfortunately Javascript is not running on your browser, so you cannot change your settings. You can try:
cy: Rydym yn defnyddio Javascript i osod y rhan fwyaf o’n cwcis. Yn anffodus, nid yw Javascript yn rhedeg ar eich porwr, felly ni allwch newid eich gosodiadau. Gallwch geisio:

source: reloading the page
cy: ail-lwytho'r dudalen

source: turning on Javascript in your browser
cy: rhoi Javascript ar waith yn eich porwr

source: Essential cookies (strictly necessary)
cy: Cwcis hanfodol (rhai cwbl angenrheidiol)

source: We use an essential cookie to remember when you accept or reject cookies on our website.
cy: Rydym yn defnyddio cwci hanfodol i gofio pan fyddwch yn derbyn neu’n gwrthod cwcis ar ein gwefan.

source: Essential cookies we use
cy: Cwcis hanfodol rydym yn eu defnyddio

source: Name
cy: Enw

source: Purpose
cy: Pwrpas

source: Expires
cy: Daw i ben

source: Saves your cookie consent settings
cy: Mae’n cadw eich gosodiadau caniatâd cwcis

source: 1 year
cy: 1 flwyddyn

source: Essential if you choose to use the Welsh language version of the site
cy: Hanfodol os ydych yn dewis defnyddio fersiwn Gymraeg y wefan

source: When you close your browser
cy: Pan fyddwch yn cau eich porwr

source: Analytics cookies (optional)
cy: Cwcis dadansoddol (dewisol)

source: We use Google Analytics software to understand how people use Find a legal aid adviser or family mediator. We do this to help make sure the site is meeting the needs of its users and to help us make improvements.
cy: Rydym yn defnyddio meddalwedd Google Analytics i ddeall sut mae pobl yn defnyddio Dod o hyd i gynghorydd cymorth cyfreithiol neu gyfryngwr teulu. Fe wnawn hyn i sicrhau bod y wefan yn diwallu anghenion ei defnyddwyr ac i’n helpu ni i wneud gwelliannau.

source: We do not collect or store your personal information (for example your name or address) so this information cannot be used to identify who you are.
cy: Nid ydym yn casglu nac yn storio eich gwybodaeth bersonol (er enghraifft eich enw neu’ch cyfeiriad) felly ni ellir defnyddio’r wybodaeth hon i ddatgelu pwy ydych chi.

source: We do not allow Google to use or share our analytics data.
cy: Nid ydym yn caniatáu i Google ddefnyddio na rhannu ein data dadansoddol.

source: Google Analytics stores information about
cy: Mae Google Analytics yn storio gwybodaeth am y canlynol

source: Analytics cookies we use
cy: Cwcis dadansoddol rydym yn eu defnyddio

source: Helps us count how many people visit Find a legal aid adviser or family mediator by telling us if you’ve visited before.
cy: Mae’n ein helpu i gyfrif faint o bobl sy’n ymweld â Dod o hyd i gynghorydd cymorth cyfreithiol neu gyfryngwr teulu drwy ddweud wrthym a ydych chi wedi ymweld o’r blaen.

source: 2 years
cy: 2 flynedd

source: Used by Google Analytics to find and track an individual session with your device.
cy: Mae Google Analytics yn ei ddefnyddio i ganfod a thracio sesiynau unigol gyda’ch dyfais.

source: Back
cy: Yn ôl

source: Change search
cy: Newid y manylion chwilio

source: The postcode
cy: Mae’r cod post

source: is in
cy: yn

source: This search only covers England and Wales.
cy: Dim ond ar gyfer Cymru a Lloegr y mae’r chwiliad hwn yn berthnasol.

source: Find out about
cy: Cael gwybod am

source: Legal Aid in
cy: Gymorth Cyfreithiol yn

source: or try a different search.
cy: neu chwiliwch am rywbeth gwahanol.

source: What data we collect
cy: Pa ddata rydym yn ei gasglu

source: This service is provided by the
cy: Darperir y gwasanaeth hwn gan yr

source: part of the Ministry of Justice
cy: sy’n rhan o’r Weinyddiaeth Gyfiawnder

source: We do not collect any
cy: Nid ydym yn casglu unrhyw

source: personal information
cy: wybodaeth bersonol

source: that could identify an individual in this service.
cy: a allai ddatgelu pwy yw unigolyn yn y gwasanaeth hwn.

source: We do collect personal information about individuals using this website. This information is collected separately from and cannot be linked to information submitted. We collect:
cy: Rydym yn casglu gwybodaeth bersonol am unigolion sy’n defnyddio’r wefan hon. Cesglir y wybodaeth hon ar wahân i’r wybodaeth a gyflwynir ac ni ellir eu cysylltu â’i gilydd. Rydym yn casglu:

source: your Internet Protocol
cy: eich cyfeiriad Protocol Rhyngrwyd

source: address
cy: cyfeiriad

source: details of which version of
cy: manylion pa fersiwn o

source: web browser
cy: borwr gwe

source: you used
cy: y gwnaethoch ei defnyddio

source: information on how you use the site, using cookies and page tagging techniques
cy: gwybodaeth am sut rydych chi’n defnyddio’r wefan, gan ddefnyddio cwcis a thechnegau tagio tudalennau

source: the search information you enter, such as postcode or organisation
cy: y wybodaeth a roddwch wrth chwilio, fel cod post neu sefydliad

source: Where you provide your consent, we use
cy: Os ydych wedi rhoi eich caniatâd, rydym yn defnyddio cwcis

source: cookies. Google Analytics processes information about:
cy: Mae Google Analytics yn prosesu gwybodaeth am y canlynol:

source: We make sure you cannot be identified by Google Analytics data.
cy: Rydym yn gwneud yn siŵr nad yw data Google Analytics yn datgelu pwy ydych chi.

source: We do not pass any of your personal data to Google Analytics, and Google Analytics does not store your IP address.
cy: Nid ydym yn trosglwyddo unrhyw ran o’ch data personol i Google Analytics, ac nid yw Google Analytics yn storio eich cyfeiriad IP.

source: We will not combine analytics information with other data sets in a way that would identify who you are.
cy: Ni fyddwn yn cyfuno gwybodaeth ddadansoddi â setiau data eraill mewn ffordd a fyddai’n datgelu pwy ydych chi.

source: Why we need your data
cy: Pam mae angen eich data arnom

source: We collect your data to:
cy: Rydym yn casglu eich data er mwyn:

source: provide you with information about local services
cy: rhoi gwybodaeth i chi am wasanaethau lleol

source: gather feedback to improve our services
cy: casglu adborth i wella ein gwasanaethau
